#!/usr/bin/env python
# -*- encoding: UTF-8 -*-
"""
@Project: ChinaTobaccoContract_V2_new_version_riskAdd
@File: test.py
@Author: Mr.Blonde
@Date: 2022/3/8 11:19
"""
# 编写代码时测试相关函数的文件，可删除
import datetime
import  re
a='2017'
b='3'
c='22'
a1='2018'
b1='3'
c1='21'

day1=datetime.date(int(a),int(b),int(c))
day2=datetime.date(int(a1),int(b1),int(c1))

result=day2.__sub__(day1).days
print(result)
tu=tuple()
d1 = {'name': 'revotu', 'age': 99}

d2 = {'age': 24, 'sex': 'male'}
d={}
d.update(d1)
d.update(d2)
print(d)

content1='甲方：四川省烟草公司达州市公司'

match = '甲方：(.*)'

factor = re.findall(match, content1)
print(factor)

a=['甲方', '甲方1', '甲方住所地', '甲方住所地1', '甲方法定代表人', '甲方法定代表人1', '甲方组织信用代码/身份证号', '甲方组织信用代码/身份证号1', '甲方联系方式', '甲方联系方式1', '乙方', '乙方1', '乙方住所地', '乙方住所地1', '乙方法定代表人', '乙方法定代表人1', '乙方组织信用代码/身份证号', '乙方组织信用代码/身份证号1', '乙方联系方式', '乙方联系方式1', '物业服务范围', '物业服务地点', '合同期限', '安全保卫', '卫生保洁', '卫生保洁-其他', '接待及会务服务', '员工食堂', '设施设备维修', '绿化养护', '物业管理费', '物管费支付', '物管费支付期限', '履约保证金', '履约保证金支付期限', '考核期限', '违约金', '总份数', '双方份数', '甲方-尾部', '乙方-尾部', '甲方法定（授权）代表人', '乙方法定（授权）代表人', '签字时间甲方', '签字时间乙方']
b=['甲方', '甲方住所地', '甲方法定代表人', '甲方组织信用代码/身份证号', '甲方组织信用代码/身份证号1', '甲方联系方式', '甲方联系方式1', '乙方', '乙方住所地', '乙方法定代表人', '乙方组织信用代码/身份证号', '乙方组织信用代码/身份证号1', '乙方联系方式', '乙方联系方式1', '物业服务范围', '物业服务地点', '合同期限', '安全保卫', '卫生保洁', '卫生保洁-其他', '接待及会务服务', '员工食堂', '设施设备维修', '绿化养护', '物业管理费', '物管费支付', '物管费支付期限', '履约保证金', '履约保证金支付期限', '考核标准表', '考核期限', '违约金', '总份数', '双方份数', '甲方-尾部', '乙方-尾部', '甲方法定（授权）代表人', '乙方法定（授权）代表人', '签字时间甲方', '签字时间乙方']
result=list(set(a)-set(b))
print('空的error比全假的多的：\n',result)

match='合同主要条款\n(.*?)'
str1='第六章  合同主要条款\n甲方：中国烟草总公司四川省公司\n乙方：'
print(type(str1))
factor=re.findall(match,str1)[0]
print(factor)